AccumulationRegisters/ПродажиПоДисконтнымКартам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<AccumulationRegister>
		<Properties>
			<Name>ПродажиПоДисконтнымКартам</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Скидка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДисконтнаяКарта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДисконтныеКарты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВладелецКарты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/БонусныеБаллы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<AccumulationRegister>
		<Properties>
			<Name>БонусныеБаллы</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Начислено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КСписанию</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаПервоначальногоНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>БонуснаяКарта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДисконтныеКарты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/БонусныеБаллыКСписанию.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>БонусныеБаллыКСписанию</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КСписанию</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДисконтнаяКарта</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КартаЛояльностиСерверЛояльности</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>БонуснаяПрограммаЛояльности</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.БонуснаяПрограммаСерверЛояльности</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыСкидокВДисконтныхКартах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ВидыСкидокВДисконтныхКартах</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ФиксированнаяСкидка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НакопительнаяСкидка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/УсловияПредоставленияСкидокНаценок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>УсловияПредоставленияСкидокНаценок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗаРазовыйОбъемПродаж</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаКомплектПокупки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаНакопленныйОбъемПродаж</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаДисконтнуюКарту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаДеньРождения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаПромокод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаАктивациюВручную</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизвольныйЗапрос</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расширение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаВидОплаты</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыКодовКарт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ТипыКодовКарт</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Штрихкод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МагнитныйКод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НомерТелефона</Name>
					<Comment>Используется только для поиска ДК по номеру телефона, не может являться полноценным кодом карты</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыКарт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ТипыКарт</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Магнитная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Штриховая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Смешанная</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыСтруктурныхЕдиниц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ТипыСтруктурныхЕдиниц</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Склад</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Розница</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РозницаСуммовойУчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МагазинГруппаСкладов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подразделение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыПериодовДляНакопительныхСкидок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ВидыПериодовДляНакопительныхСкидок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Текущий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прошлый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Последний</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВесьПериод</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/Периодичность.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>Периодичность</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>День</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неделя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Декада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Квартал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Полугодие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Год</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/ДисконтныеКартыУНФСервер/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

Функция ТекстЗапросаПродажиПоДисконтнойКарте(ИмяДокумента) Экспорт
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ТаблицаПродажи.Период КАК Период,
	|	ТаблицаПродажи.Документ.ДисконтнаяКарта КАК ДисконтнаяКарта,
	|	ТаблицаПродажи.Номенклатура КАК Номенклатура,
	|	ТаблицаПродажи.Характеристика КАК Характеристика,
	|	ТаблицаПродажи.Документ.ДисконтнаяКарта.ВладелецКарты КАК ВладелецКарты,
	|	СУММА(ТаблицаПродажи.Количество) КАК Количество,
	|	СУММА(ТаблицаПродажи.Сумма) КАК Сумма,
	|	&ПроцентСкидки КАК Скидка
	|ИЗ
	|	ВременнаяТаблица КАК ТаблицаПродажи
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаПродажи.Период,
	|	ТаблицаПродажи.Документ.ДисконтнаяКарта,
	|	ТаблицаПродажи.Документ.ДисконтнаяКарта.ВладелецКарты,
	|	ТаблицаПродажи.Номенклатура,
	|	ТаблицаПродажи.Характеристика
	|
	|ИМЕЮЩИЕ
	|	(СУММА(ТаблицаПродажи.Количество) <> 0
	|		ИЛИ СУММА(ТаблицаПродажи.Сумма) <> 0)";
	
	Если ИмяДокумента = "АктВыполненныхРабот" Тогда
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ВременнаяТаблица", "ВременнаяТаблицаРаботыИУслуги");
		
	ИначеЕсли ИмяДокумента = "РасходнаяНакладная"
		Или ИмяДокумента = "КорректировкаРеализации" Тогда
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ВременнаяТаблица", "ВременнаяТаблицаЗапасы");
		
	ИначеЕсли ИмяДокумента = "ЧекККМ" Тогда
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ВременнаяТаблица", "ВременнаяТаблицаЗапасы");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ".Период", ".Дата");
		
	ИначеЕсли ИмяДокумента = "ЧекККМВозврат" Тогда
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ВременнаяТаблица", "ВременнаяТаблицаЗапасы");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ".Период", ".Дата");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "СУММА(", "-СУММА("); // это возврат
		
	ИначеЕсли ИмяДокумента = "ПриходнаяНакладная" Тогда
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ВременнаяТаблица", "ВременнаяТаблицаЗапасы");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "СУММА(", "-СУММА("); // это возврат
		
	ИначеЕсли ИмяДокумента = "ОтчетОРозничныхПродажах" Тогда
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ВременнаяТаблица", "ВременнаяТаблицаЗапасы");
		
		// дисконтная карта в ТЧ
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Документ.ДисконтнаяКарта", "ДисконтнаяКарта");
		
		// дисконтная карта в ТЧ, необходимо условие в запросе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "
			|
			|СГРУППИРОВАТЬ ПО", "
			|ГДЕ
			|	ТаблицаПродажи.ДисконтнаяКарта <> ЗНАЧЕНИЕ(Справочник.ДисконтныеКарты.ПустаяСсылка)
			|
			|СГРУППИРОВАТЬ ПО");
		
	ИначеЕсли ИмяДокумента = "ЗаказПокупателя" Тогда
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ВременнаяТаблица", "ВременнаяТаблицаРаботы");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ".Период", ".Финиш");
		
		// в документе две ТЧ
		ТекстЗапроса = ТекстЗапроса + "
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТаблицаПродажи.Финиш,
		|	ТаблицаПродажи.Документ.ДисконтнаяКарта,
		|	ТаблицаПродажи.Номенклатура КАК Номенклатура,
		|	ТаблицаПродажи.Характеристика КАК Характеристика,
		|	ТаблицаПродажи.Документ.ДисконтнаяКарта.ВладелецКарты,
		|	СУММА(ТаблицаПродажи.Количество),
		|	СУММА(ТаблицаПродажи.Сумма),
		|	&ПроцентСкидки
		|ИЗ
		|	ВременнаяТаблицаТовары КАК ТаблицаПродажи
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаПродажи.Финиш,
		|	ТаблицаПродажи.Документ.ДисконтнаяКарта,
		|	ТаблицаПродажи.Документ.ДисконтнаяКарта.ВладелецКарты,
		|	ТаблицаПродажи.Номенклатура,
		|	ТаблицаПродажи.Характеристика";
		
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Возвращает процент скидки по дисконтной карте.
//
// Параметры:
//  ДисконтнаяКарта - СправочникСсылка.ДисконтныеКарты - Ссылка на дисконтную карту.
//
// Возвращаемое значение: 
//   Число - процент скидки.
//
Функция ВычислитьПроцентСкидкиПоДисконтнойКарте(Знач ДатаСкидки, ДисконтнаяКарта, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ДатаСкидки) Тогда
		ДатаСкидки = ТекущаяДата();
	КонецЕсли;
	
	Если ДисконтнаяКарта.Владелец.ВидСкидкиВДисконтныхКартах = Перечисления.ВидыСкидокВДисконтныхКартах.ФиксированнаяСкидка Тогда
		
		Если ДополнительныеПараметры <> Неопределено И ДополнительныеПараметры.ПолучатьСуммуПродаж Тогда
			ПериодНакопления = ПолучитьПериодРасчетаНакопительныхСкидокПоДисконтнойКарте(ДатаСкидки, ДисконтнаяКарта.Ссылка);

			ДополнительныеПараметры.Вставить("ПредставлениеПериода", ПериодНакопления.ПредставлениеПериода);
			
			Запрос = Новый Запрос("ВЫБРАТЬ
			|	ДисконтныеКарты.Ссылка КАК ДисконтнаяКарта
			|ПОМЕСТИТЬ втДанныеКарты
			|ИЗ
			|	Справочник.ДисконтныеКарты КАК ДисконтныеКарты
			|ГДЕ
			|	ДисконтныеКарты.Ссылка = &ДисконтнаяКарта
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	СУММА(ЕСТЬNULL(РегПродажи.СуммаОборот, 0)) КАК СуммаОборот,
			|	СУММА(ЕСТЬNULL(БонусныеБаллыОстатки.НачисленоОстаток, 0) - ЕСТЬNULL(БонусныеБаллыОстатки.КСписаниюОстаток, 0)) КАК ОстатокБонусныхБаллов
			|ИЗ
			|	втДанныеКарты КАК втДанныеКарты
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПродажиПоДисконтнымКартам.Обороты(&ДатаНач, &ДатаКон, , ) КАК РегПродажи
			|		ПО втДанныеКарты.ДисконтнаяКарта = РегПродажи.ДисконтнаяКарта
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.БонусныеБаллы.Остатки(&ДатаСеанса, ) КАК БонусныеБаллыОстатки
			|		ПО втДанныеКарты.ДисконтнаяКарта = БонусныеБаллыОстатки.БонуснаяКарта");

			Запрос.УстановитьПараметр("ДатаНач", ПериодНакопления.НачалоПериода);
			Запрос.УстановитьПараметр("ДатаКон", ПериодНакопления.КонецПериода);
			Запрос.УстановитьПараметр("ДатаСеанса", ТекущаяДатаСеанса());
			Запрос.УстановитьПараметр("ДисконтнаяКарта", ДисконтнаяКарта.Ссылка);

			Выборка = Запрос.Выполнить().Выбрать();
			ОстатокБонусныхБаллов = 0;
			Если Выборка.Следующий() Тогда
				ДополнительныеПараметры.Сумма = Выборка.СуммаОборот;
				ОстатокБонусныхБаллов = Выборка.ОстатокБонусныхБаллов;
			Иначе
				ДополнительныеПараметры.Сумма = 0;
			КонецЕсли;
			Если ДополнительныеПараметры.Свойство("ОстатокБонусныхБаллов") Тогда
				ДополнительныеПараметры.ОстатокБонусныхБаллов = ОстатокБонусныхБаллов;
			КонецЕсли;
		
		КонецЕсли;
		
		Если ДисконтнаяКарта.Владелец.СтарыйМеханизмСкидок Тогда
			Возврат ДисконтнаяКарта.Владелец.Скидка;
		Иначе
			Возврат 0;
		КонецЕсли;
		
	Иначе
		
		ПериодНакопления = ПолучитьПериодРасчетаНакопительныхСкидокПоДисконтнойКарте(ДатаСкидки, ДисконтнаяКарта.Ссылка);
		
		Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
		                      |	Пороги.Скидка КАК Скидка,
		                      |	Пороги.НижняяГраница КАК НижняяГраница
		                      |ПОМЕСТИТЬ ВТ_Пороги
		                      |ИЗ
		                      |	Справочник.ВидыДисконтныхКарт.ПорогиНакопительныхСкидок КАК Пороги
		                      |ГДЕ
		                      |	Пороги.Ссылка = &ВидДисконтнойКарты
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		                      |	РегПороги.Скидка КАК Скидка
		                      |ИЗ
		                      |	(ВЫБРАТЬ
		                      |		ЕСТЬNULL(СУММА(РегПродажи.СуммаОборот), 0) КАК СуммаОборот
		                      |	ИЗ
		                      |		РегистрНакопления.ПродажиПоДисконтнымКартам.Обороты(&ДатаНач, &ДатаКон, , ДисконтнаяКарта = &ДисконтнаяКарта) КАК РегПродажи) КАК РегПродажи
		                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		                      |			Пороги.НижняяГраница КАК НижняяГраница,
		                      |			Пороги.Скидка КАК Скидка
		                      |		ИЗ
		                      |			ВТ_Пороги КАК Пороги) КАК РегПороги
		                      |		ПО (РегПороги.НижняяГраница <= РегПродажи.СуммаОборот)
		                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		                      |			МАКСИМУМ(РегПороги.НижняяГраница) КАК НижняяГраница
		                      |		ИЗ
		                      |			(ВЫБРАТЬ
		                      |				ЕСТЬNULL(СУММА(РегПродажи.СуммаОборот), 0) КАК СуммаОборот
		                      |			ИЗ
		                      |				РегистрНакопления.ПродажиПоДисконтнымКартам.Обороты(&ДатаНач, &ДатаКон, , ДисконтнаяКарта = &ДисконтнаяКарта) КАК РегПродажи) КАК РегПродажи
		                      |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		                      |					Пороги.НижняяГраница КАК НижняяГраница
		                      |				ИЗ
		                      |					ВТ_Пороги КАК Пороги) КАК РегПороги
		                      |				ПО (РегПороги.НижняяГраница <= РегПродажи.СуммаОборот)) КАК РегПорогиМакс
		                      |		ПО (РегПорогиМакс.НижняяГраница = РегПороги.НижняяГраница)");

		Запрос.УстановитьПараметр("ДатаНач", ПериодНакопления.НачалоПериода);
		Запрос.УстановитьПараметр("ДатаКон", ПериодНакопления.КонецПериода);
		Запрос.УстановитьПараметр("ДисконтнаяКарта", ДисконтнаяКарта.Ссылка);
        Запрос.УстановитьПараметр("ВидДисконтнойКарты", ДисконтнаяКарта.Владелец);

		Если ДополнительныеПараметры <> Неопределено 
			И ДополнительныеПараметры.ПолучатьСуммуПродаж Тогда
			ДополнительныеПараметры.Вставить("ПредставлениеПериода", ПериодНакопления.ПредставлениеПериода);
			
			Запрос.Текст = Запрос.Текст + ";
											|////////////////////////////////////////////////////////////////////////////////
											|ВЫБРАТЬ
											|	ДисконтныеКарты.Ссылка КАК ДисконтнаяКарта
											|ПОМЕСТИТЬ втДанныеКарты
											|ИЗ
											|	Справочник.ДисконтныеКарты КАК ДисконтныеКарты
											|ГДЕ
											|	ДисконтныеКарты.Ссылка = &ДисконтнаяКарта
											|;
											|
											|////////////////////////////////////////////////////////////////////////////////
											|ВЫБРАТЬ
											|	СУММА(ЕСТЬNULL(РегПродажи.СуммаОборот, 0)) КАК СуммаОборот,
											|	СУММА(ЕСТЬNULL(БонусныеБаллыОстатки.НачисленоОстаток, 0) - ЕСТЬNULL(БонусныеБаллыОстатки.КСписаниюОстаток, 0)) КАК ОстатокБонусныхБаллов
											|ИЗ
											|	втДанныеКарты КАК втДанныеКарты
											|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПродажиПоДисконтнымКартам.Обороты(&ДатаНач, &ДатаКон, , ) КАК РегПродажи
											|		ПО втДанныеКарты.ДисконтнаяКарта = РегПродажи.ДисконтнаяКарта
											|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.БонусныеБаллы.Остатки(&ДатаКон, ) КАК БонусныеБаллыОстатки
											|		ПО втДанныеКарты.ДисконтнаяКарта = БонусныеБаллыОстатки.БонуснаяКарта";
			МРезультатов = Запрос.ВыполнитьПакет();
			
			Выборка = МРезультатов[1].Выбрать();
			Если Выборка.Следующий() Тогда
				ПроцентНакопительнойСкидки = Выборка.Скидка;
			Иначе
				ПроцентНакопительнойСкидки = 0;
			КонецЕсли;		
			
			ВыборкаПоСуммеПродаж = МРезультатов[3].Выбрать();
			ОстатокБонусныхБаллов = 0;
			Если ВыборкаПоСуммеПродаж.Следующий() Тогда
				ДополнительныеПараметры.Сумма = ВыборкаПоСуммеПродаж.СуммаОборот;
				ОстатокБонусныхБаллов = ВыборкаПоСуммеПродаж.ОстатокБонусныхБаллов;
			Иначе
				ДополнительныеПараметры.Сумма = 0;
			КонецЕсли;
			Если ДополнительныеПараметры.Свойство("ОстатокБонусныхБаллов") Тогда
				ДополнительныеПараметры.ОстатокБонусныхБаллов = ОстатокБонусныхБаллов;
			КонецЕсли;
			
			
			Если ДисконтнаяКарта.Владелец.СтарыйМеханизмСкидок Тогда
				Возврат ПроцентНакопительнойСкидки;
			Иначе
				Возврат 0;
			КонецЕсли;

		Иначе
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				ПроцентНакопительнойСкидки = Выборка.Скидка;
			Иначе
				ПроцентНакопительнойСкидки = 0;
			КонецЕсли;		
				
			Если ДисконтнаяКарта.Владелец.СтарыйМеханизмСкидок Тогда
				Возврат ПроцентНакопительнойСкидки;
			Иначе
				Возврат 0;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции

Процедура ПроверитьИСоздатьУсловиеПоДисконтнойКарте() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УсловияПредоставленияСкидокНаценок.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.УсловияПредоставленияСкидокНаценок КАК УсловияПредоставленияСкидокНаценок
	|ГДЕ
	|	УсловияПредоставленияСкидокНаценок.УсловиеПредоставления В (ЗНАЧЕНИЕ(Перечисление.УсловияПредоставленияСкидокНаценок.ЗаДисконтнуюКарту), ЗНАЧЕНИЕ(Перечисление.УсловияПредоставленияСкидокНаценок.ЗаНакопленныйОбъемПродаж))";
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Если РезультатЗапроса.Следующий() Тогда
		Возврат;
	КонецЕсли;
	
	УсловиеСкидки = Справочники.УсловияПредоставленияСкидокНаценок.СоздатьЭлемент();
	УсловиеСкидки.УсловиеПредоставления = Перечисления.УсловияПредоставленияСкидокНаценок.ЗаДисконтнуюКарту;
	УсловиеСкидки.Наименование = НСтр("ru = 'Предъявлена дисконтная карта'");
	УсловиеСкидки.Записать();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Функция выполняет поиск дисконтных карт по магнитному коду
//
// Параметры
//  Магнитный код - Строка
//
// Возвращаемое значение
//  Структура. В структуре содержится 2 таблицы значений: Зарегистрированные дисконтные карты
//  и НеЗарегистрированныеДисконтныеКарты.
//
Функция НайтиДисконтныеКартыПоМагнитномуКоду(МагнитныйКод) Экспорт
	
	Возврат НайтиДисконтныеКарты(МагнитныйКод, Перечисления.ТипыКодовКарт.МагнитныйКод);
	
КонецФункции

// Функция выполняет поиск дисконтных карт
//
// Параметры:
//  КодКарты	 - Строка	 - код дисконтной карты для поиска.
//  ТипКода		 - 			 - Перечисление.ТипыКодовКарт
//  Шаблон		 - Структура - Шаблон магнитного кода.
//  ПоискИзЧека	 - Булево	 - признак поиска из ЧекаККМ.
// 
// Возвращаемое значение:
//  Структура. В - структуре содержится 2 таблицы значений: Зарегистрированные дисконтные карты
//  и НеЗарегистрированныеДисконтныеКарты.
//
Функция НайтиДисконтныеКарты(КодКарты, ТипКода, Шаблон = Неопределено, ПоискИзЧека = Ложь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ЗарегистрированныеДисконтныеКарты = Новый Массив;
	НеЗарегистрированныеДисконтныеКарты = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВидыДисконтныхКарт.Ссылка КАК Ссылка,
	|	ВидыДисконтныхКарт.ЭтоИменнаяКарта КАК ЭтоИменнаяКарта,
	|	ВидыДисконтныхКарт.ТипКарты КАК ТипКарты,
	|	ВидыДисконтныхКарт.ШаблонДисконтнойКарты КАК ШаблонДисконтнойКарты,
	|	ВидыДисконтныхКарт.ПометкаУдаления КАК ПометкаУдаления
	|ПОМЕСТИТЬ ВидыКарт
	|ИЗ
	|	Справочник.ВидыДисконтныхКарт КАК ВидыДисконтныхКарт
	|ГДЕ
	|	(ВидыДисконтныхКарт.ТипКарты = &ТипКартыСмешанная
	|			ИЛИ ВидыДисконтныхКарт.ТипКарты = &ТипКарты)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДисконтныеКарты.Ссылка КАК Ссылка,
	|	ДисконтныеКарты.Наименование КАК Наименование,
	|	ДисконтныеКарты.КодКартыШтрихкод КАК Штрихкод,
	|	ДисконтныеКарты.КодКартыМагнитный КАК МагнитныйКод,
	|	ДисконтныеКарты.ВладелецКарты КАК Контрагент,
	|	ДисконтныеКарты.Владелец КАК ВидКарты,
	|	ДисконтныеКарты.Владелец.ЭтоИменнаяКарта КАК ЭтоИменнаяКарта,
	|	ДисконтныеКарты.Владелец.ТипКарты КАК ТипКарты,
	|	ДисконтныеКарты.КартаНедействительна КАК КартаНедействительна
	|ПОМЕСТИТЬ ДисконтныеКарты
	|ИЗ
	|	Справочник.ДисконтныеКарты КАК ДисконтныеКарты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВидыКарт КАК ВидыКарт
	|		ПО (ВидыКарт.Ссылка = ДисконтныеКарты.Владелец)
	|			И (&ИмяПоляКодКарты = &КодКарты)
	|			И (НЕ ДисконтныеКарты.ПометкаУдаления)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ДисконтныеКарты.Контрагент) КАК КоличествоКонтрагентов
	|ПОМЕСТИТЬ втДанныеКонтрагента
	|ИЗ
	|	ДисконтныеКарты КАК ДисконтныеКарты
	|ГДЕ
	|	ДисконтныеКарты.ЭтоИменнаяКарта
	|	И &ПоискИзЧека
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДисконтныеКарты.Контрагент КАК Контрагент
	|ПОМЕСТИТЬ втСписокКонтрагентов
	|ИЗ
	|	ДисконтныеКарты КАК ДисконтныеКарты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДисконтныеКарты.Ссылка КАК Ссылка,
	|	ДисконтныеКарты.Наименование КАК Наименование,
	|	ДисконтныеКарты.КодКартыШтрихкод КАК Штрихкод,
	|	ДисконтныеКарты.КодКартыМагнитный КАК МагнитныйКод,
	|	ДисконтныеКарты.ВладелецКарты КАК Контрагент,
	|	ДисконтныеКарты.Владелец КАК ВидКарты,
	|	ВидыДисконтныхКарт.ЭтоИменнаяКарта КАК ЭтоИменнаяКарта,
	|	ВидыДисконтныхКарт.ТипКарты КАК ТипКарты,
	|	ДисконтныеКарты.КартаНедействительна КАК КартаНедействительна
	|ПОМЕСТИТЬ ДанныеОКартах
	|ИЗ
	|	втСписокКонтрагентов КАК втСписокКонтрагентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДисконтныеКарты КАК ДисконтныеКарты
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыДисконтныхКарт КАК ВидыДисконтныхКарт
	|			ПО ДисконтныеКарты.Владелец = ВидыДисконтныхКарт.Ссылка
	|		ПО втСписокКонтрагентов.Контрагент = ДисконтныеКарты.ВладелецКарты
	|		ЛЕВОЕ СОЕДИНЕНИЕ втДанныеКонтрагента КАК втДанныеКонтрагента
	|		ПО (ИСТИНА)
	|ГДЕ
	|	ЕСТЬNULL(втДанныеКонтрагента.КоличествоКонтрагентов, 0) = 1
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	втДисконтныеКарты.Ссылка,
	|	втДисконтныеКарты.Наименование,
	|	втДисконтныеКарты.Штрихкод,
	|	втДисконтныеКарты.МагнитныйКод,
	|	втДисконтныеКарты.Контрагент,
	|	втДисконтныеКарты.ВидКарты,
	|	втДисконтныеКарты.ЭтоИменнаяКарта,
	|	втДисконтныеКарты.ТипКарты,
	|	втДисконтныеКарты.КартаНедействительна
	|ИЗ
	|	ДисконтныеКарты КАК втДисконтныеКарты
	|		ЛЕВОЕ СОЕДИНЕНИЕ втДанныеКонтрагента КАК втДанныеКонтрагента
	|		ПО (ИСТИНА)
	|ГДЕ
	|	ЕСТЬNULL(втДанныеКонтрагента.КоличествоКонтрагентов, 0) = 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	втДисконтныеКарты.Ссылка,
	|	втДисконтныеКарты.Наименование,
	|	втДисконтныеКарты.Штрихкод,
	|	втДисконтныеКарты.МагнитныйКод,
	|	втДисконтныеКарты.Контрагент,
	|	втДисконтныеКарты.ВидКарты,
	|	втДисконтныеКарты.ЭтоИменнаяКарта,
	|	втДисконтныеКарты.ТипКарты,
	|	втДисконтныеКарты.КартаНедействительна
	|ИЗ
	|	ДисконтныеКарты КАК втДисконтныеКарты
	|		ЛЕВОЕ СОЕДИНЕНИЕ втДанныеКонтрагента КАК втДанныеКонтрагента
	|		ПО (ИСТИНА)
	|ГДЕ
	|	ЕСТЬNULL(втДанныеКонтрагента.КоличествоКонтрагентов, 0) > 1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	1 КАК Порядок,
	|	ДанныеОКартах.Ссылка КАК Ссылка,
	|	ДанныеОКартах.Наименование КАК Наименование,
	|	ДанныеОКартах.Штрихкод КАК Штрихкод,
	|	ДанныеОКартах.МагнитныйКод КАК МагнитныйКод,
	|	ДанныеОКартах.Контрагент КАК Контрагент,
	|	ДанныеОКартах.ВидКарты КАК ВидКарты,
	|	ДанныеОКартах.ЭтоИменнаяКарта КАК ЭтоИменнаяКарта,
	|	ДанныеОКартах.ТипКарты КАК ТипКарты,
	|	ЗНАЧЕНИЕ(Справочник.ШаблоныДисконтныхКарт.ПустаяСсылка) КАК ШаблонДисконтнойКарты,
	|	ДанныеОКартах.КартаНедействительна КАК КартаНедействительна
	|ИЗ
	|	ДанныеОКартах КАК ДанныеОКартах
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	2,
	|	ЗНАЧЕНИЕ(Справочник.ДисконтныеКарты.ПустаяСсылка),
	|	"""",
	|	&Штрихкод,
	|	&МагнитныйКод,
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка),
	|	ВидыКарт.Ссылка,
	|	ВидыКарт.ЭтоИменнаяКарта,
	|	ВидыКарт.ТипКарты,
	|	ВидыКарт.ШаблонДисконтнойКарты,
	|	ЛОЖЬ
	|ИЗ
	|	ВидыКарт КАК ВидыКарт
	|ГДЕ
	|	НЕ ВидыКарт.Ссылка В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					Т.ВидКарты
	|				ИЗ
	|					ДисконтныеКарты КАК Т)
	|	И НЕ ВидыКарт.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок
	|ИТОГИ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Ссылка),
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ КартаНедействительна)
	|ПО
	|	Контрагент";
	
	Запрос.УстановитьПараметр("ТипКартыСмешанная", Перечисления.ТипыКарт.Смешанная);
	Запрос.УстановитьПараметр("ПоискИзЧека", ПоискИзЧека);
	Если ТипКода = Перечисления.ТипыКодовКарт.МагнитныйКод Тогда
		Запрос.УстановитьПараметр("ТипКарты", Перечисления.ТипыКарт.Магнитная);
	Иначе
		Запрос.УстановитьПараметр("ТипКарты", Перечисления.ТипыКарт.Штриховая);
	КонецЕсли;
	
	Если ТипКода = Перечисления.ТипыКодовКарт.МагнитныйКод Тогда
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"&ИмяПоляКодКарты",        "ДисконтныеКарты.КодКартыМагнитный");
		
		Запрос.УстановитьПараметр("Штрихкод",     "");
		Запрос.УстановитьПараметр("МагнитныйКод", КодКарты);
		
	Иначе
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"&ИмяПоляКодКарты",        "ДисконтныеКарты.КодКартыШтрихкод");
		
		Запрос.УстановитьПараметр("Штрихкод",     КодКарты);
		Запрос.УстановитьПараметр("МагнитныйКод", "");
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("КодКарты",  КодКарты);
	Запрос.УстановитьПараметр("ДлинаКода", СтрДлина(КодКарты));
	
	Результат = Запрос.Выполнить();
	ВыборкаКонтрагенты = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаКонтрагенты.Следующий() Цикл
		КоличествоКарт = ВыборкаКонтрагенты.Ссылка;
		КоличествоСтатусов = ВыборкаКонтрагенты.КартаНедействительна;
		Выборка = ВыборкаКонтрагенты.Выбрать();
		Пока Выборка.Следующий() Цикл
			Если ЗначениеЗаполнено(Выборка.Ссылка) Тогда
				Если КоличествоКарт > 1 И КоличествоСтатусов > 1 Тогда
					КартаТекущая = Ложь;
					Если ТипКода = Перечисления.ТипыКодовКарт.МагнитныйКод Тогда
						КартаТекущая = Выборка.МагнитныйКод = КодКарты;
					Иначе
						КартаТекущая = Выборка.Штрихкод = КодКарты;
					КонецЕсли;
					Если НЕ КартаТекущая
						И Выборка.КартаНедействительна Тогда
						Продолжить;
					КонецЕсли;
				КонецЕсли;
				НоваяСтрока = ПолучитьСтруктуруДанныхДисконтнойКарты();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
				ЗарегистрированныеДисконтныеКарты.Добавить(НоваяСтрока);
			Иначе
				ТекШаблон = Выборка.ШаблонДисконтнойКарты;
				// Эта функция вызывается при вводе кода вручную.
				// Пользователь будет вводить сам код, по-этому его нельзя проверить на соответствие шаблону, т.к. мы не знаем, что
				// содержится на магнитной дорожке. Т.е. будем давать выбрать любой вид дисконтной карты.
				// Если код считан с магнитной карты, то выполняется другая функция, где проверка на соответствие шаблону выполняется.
				Если ТекШаблон.Пустая() ИЛИ ПростаяПроверкаШаблонаМК(КодКарты, ТекШаблон) Тогда
					НоваяСтрока = ПолучитьСтруктуруДанныхДисконтнойКарты();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
					НеЗарегистрированныеДисконтныеКарты.Добавить(НоваяСтрока);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	ВозвращаемоеЗначение = Новый Структура("ЗарегистрированныеДисконтныеКарты, НеЗарегистрированныеДисконтныеКарты");
	ВозвращаемоеЗначение.ЗарегистрированныеДисконтныеКарты   = ЗарегистрированныеДисконтныеКарты;
	ВозвращаемоеЗначение.НеЗарегистрированныеДисконтныеКарты = НеЗарегистрированныеДисконтныеКарты;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// Функция возвращает дисконтную карту партнера, если она у него одна.
//
// Параметры
//  Партнер - СправочникСсылка.Партнеры
//
// Возвращаемое значение
//  СправочникСсылка.ДисконтныеКарты / Неопределено
//
Функция ПолучитьКартуПоУмолчаниюДляПартнера(Контрагент) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 2
	|	ДисконтныеКарты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ДисконтныеКарты КАК ДисконтныеКарты
	|ГДЕ
	|	ДисконтныеКарты.ВладелецКарты = &Контрагент
	|	И НЕ ДисконтныеКарты.ПометкаУдаления");
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Если Выборка.Количество() = 1 Тогда
		Выборка.Следующий();
		ЗаменяемаяКарта = Выборка.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Процедура ПроверитьИУстановитьОпциюАвтоматическиеСкидки() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Не УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("ФункциональнаяОпцияИспользоватьАвтоматическиеСкидкиНаценки") Тогда
		Константы.ФункциональнаяОпцияИспользоватьАвтоматическиеСкидкиНаценки.Установить(Истина);
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьЕдинственноеУсловиеПоДисконтнымКартам() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УсловияПредоставленияСкидокНаценок.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.УсловияПредоставленияСкидокНаценок КАК УсловияПредоставленияСкидокНаценок
	|ГДЕ
	|	УсловияПредоставленияСкидокНаценок.УсловиеПредоставления В (ЗНАЧЕНИЕ(Перечисление.УсловияПредоставленияСкидокНаценок.ЗаДисконтнуюКарту), ЗНАЧЕНИЕ(Перечисление.УсловияПредоставленияСкидокНаценок.ЗаНакопленныйОбъемПродаж))
	|	И НЕ УсловияПредоставленияСкидокНаценок.ПометкаУдаления";
	Результат = Запрос.Выполнить().Выгрузить();
	
	Количество = Результат.Количество();
	Если Количество = 1 Тогда
		
		Возврат Результат[0].Ссылка;
		
	ИначеЕсли Количество = 0 Тогда
		
		Возврат Неопределено;
		
	ИначеЕсли Количество > 1 Тогда
		
		Возврат Неопределено;
		
	КонецЕсли;
	
КонецФункции

// Проверяет, есть ли для указанного вида дисконтных карт действующие скидки
//
// Параметры
//  ВидДисконтнойКарты - Справочник.ВидыДисконтныхКарт
//
// Возвращаемое значение
//  Булево
//
Функция ЕстьСкидкиПоВидуКарт(ВидДисконтнойКарты, БонуснаяПрограмма = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УсловияНаКарту.Скидка КАК Скидка,
	|	СУММА(УсловияНаКарту.УсловийВыполнено) КАК УсловийВыполнено,
	|	СУММА(УсловияНаКарту.УсловийВсего) КАК УсловийВсего
	|ПОМЕСТИТЬ ВТ_ПроверкаУсловий
	|ИЗ
	|	(ВЫБРАТЬ
	|		АвтоматическиеСкидкиУсловияПредоставления.Ссылка КАК Скидка,
	|		ВЫБОР
	|			КОГДА АвтоматическиеСкидкиУсловияПредоставления.УсловиеПредоставления.УсловиеПредоставления = ЗНАЧЕНИЕ(Перечисление.УсловияПредоставленияСкидокНаценок.ЗаДисконтнуюКарту)
	|				ТОГДА ВЫБОР
	|						КОГДА АвтоматическиеСкидкиУсловияПредоставления.УсловиеПредоставления.ВидДисконтнойКарты = ЗНАЧЕНИЕ(Справочник.ВидыДисконтныхКарт.ПустаяСсылка)
	|							ТОГДА 1
	|						ИНАЧЕ ВЫБОР
	|								КОГДА АвтоматическиеСкидкиУсловияПредоставления.УсловиеПредоставления.ВидДисконтнойКарты = &ВидДисконтнойКарты
	|									ТОГДА 1
	|								ИНАЧЕ 0
	|							КОНЕЦ
	|					КОНЕЦ
	|			КОГДА АвтоматическиеСкидкиУсловияПредоставления.УсловиеПредоставления.УсловиеПредоставления = ЗНАЧЕНИЕ(Перечисление.УсловияПредоставленияСкидокНаценок.ЗаНакопленныйОбъемПродаж)
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК УсловийВыполнено,
	|		ВЫБОР
	|			КОГДА НЕ АвтоматическиеСкидкиУсловияПредоставления.УсловиеПредоставления.УсловиеПредоставления В (ЗНАЧЕНИЕ(Перечисление.УсловияПредоставленияСкидокНаценок.ЗаДисконтнуюКарту), ЗНАЧЕНИЕ(Перечисление.УсловияПредоставленияСкидокНаценок.ЗаНакопленныйОбъемПродаж))
	|				ТОГДА 0
	|			ИНАЧЕ 1
	|		КОНЕЦ КАК УсловийВсего
	|	ИЗ
	|		Справочник.АвтоматическиеСкидки.УсловияПредоставления КАК АвтоматическиеСкидкиУсловияПредоставления
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НачислениеБонусов.Ссылка,
	|		1,
	|		1
	|	ИЗ
	|		Справочник.АвтоматическиеСкидки КАК НачислениеБонусов
	|	ГДЕ
	|		НачислениеБонусов.БонуснаяПрограмма = &БонуснаяПрограмма) КАК УсловияНаКарту
	|
	|СГРУППИРОВАТЬ ПО
	|	УсловияНаКарту.Скидка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПроверкаУсловий.Скидка КАК Скидка
	|ИЗ
	|	ВТ_ПроверкаУсловий КАК ВТ_ПроверкаУсловий
	|ГДЕ
	|	(ВТ_ПроверкаУсловий.УсловийВыполнено >= ВТ_ПроверкаУсловий.УсловийВсего
	|			ИЛИ ВТ_ПроверкаУсловий.Скидка.ЭтоГруппа)
	|	И ВТ_ПроверкаУсловий.Скидка.Действует
	|	И ВТ_ПроверкаУсловий.УсловийВыполнено > 0
	|	И ВТ_ПроверкаУсловий.Скидка В
	|			(ВЫБРАТЬ
	|				Скидка.Ссылка
	|			ИЗ
	|				Справочник.АвтоматическиеСкидки КАК Скидка
	|			ГДЕ
	|				НЕ Скидка.ЭтоПравилоНачисленияБонусов
	|		
	|			ОБЪЕДИНИТЬ ВСЕ
	|		
	|			ВЫБРАТЬ
	|				Скидка.Ссылка
	|			ИЗ
	|				Справочник.АвтоматическиеСкидки КАК Скидка
	|			ГДЕ
	|				Скидка.ЭтоПравилоНачисленияБонусов
	|				И Скидка.БонуснаяПрограмма = &БонуснаяПрограмма)";
	
	Запрос.УстановитьПараметр("ВидДисконтнойКарты", ВидДисконтнойКарты);
	Запрос.УстановитьПараметр("БонуснаяПрограмма", ?(БонуснаяПрограмма = Неопределено, Справочники.БонусныеПрограммы.ПустаяСсылка(), БонуснаяПрограмма));
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Если РезультатЗапроса.Следующий() Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

// Функция возвращает тип кода дисконтной карты, если только он
// используется в видах дисконтных карт.
//
// Параметры
//  Нет
//
// Возвращаемое значение
//  Перечисление.ТипыКодовКарт / Неопределено
//
Функция ПолучитьОсновнойТипКодаДисконтнойКарты() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВидыДисконтныхКарт.ТипКарты КАК ТипКарты
	|ИЗ
	|	Справочник.ВидыДисконтныхКарт КАК ВидыДисконтныхКарт
	|ГДЕ
	|	НЕ ВидыДисконтныхКарт.ПометкаУдаления");
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Количество = Выборка.Количество();
	Если Количество = 0 Тогда
		Возврат Неопределено;
	ИначеЕсли Количество = 1 Тогда
		Выборка.Следующий();
		Если Выборка.ТипКарты = Перечисления.ТипыКарт.Штриховая Тогда
			Возврат Перечисления.ТипыКодовКарт.Штрихкод;
		ИначеЕсли Выборка.ТипКарты = Перечисления.ТипыКарт.Магнитная Тогда
			Возврат Перечисления.ТипыКодовКарт.МагнитныйКод;
		ИначеЕсли Выборка.ТипКарты = Перечисления.ТипыКарт.Смешанная Тогда
			Возврат Неопределено;
		Иначе
			Возврат Неопределено;
		КонецЕсли;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

// Функция возвращает пустую структуру данных дисконтных карт 
//
// Параметры
//  Нет
//
// Возвращаемое значение
//  Структура - Данные дисконтной карты
//
Функция ПолучитьСтруктуруДанныхДисконтнойКарты() Экспорт
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Штрихкод");
	СтруктураДанных.Вставить("МагнитныйКод");
	СтруктураДанных.Вставить("Ссылка");
	СтруктураДанных.Вставить("ВидКарты");
	СтруктураДанных.Вставить("ТипКарты");
	СтруктураДанных.Вставить("ЭтоИменнаяКарта");
	СтруктураДанных.Вставить("КартаНедействительна");
	СтруктураДанных.Вставить("Контрагент");
	
	Возврат СтруктураДанных;
	
КонецФункции

// Процедура записывает в базу данных дисконтную карту на основании
// переданной структуры с данными дисконтной карты.
//
// Параметры
//  СтруктураДанныхКарты - Структура с данными дисконтной карты
//
// Возвращаемое значение
//  СправочникСсылка.ДисконтныеКарты
//
Функция ЗарегистрироватьДисконтнуюКарту(СтруктураДанныхКарты) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	КартаОбъект = Справочники.ДисконтныеКарты.СоздатьЭлемент();
	
	КартаОбъект.КодКартыШтрихкод  = СтруктураДанныхКарты.Штрихкод;
	КартаОбъект.КодКартыМагнитный = СтруктураДанныхКарты.МагнитныйКод;
	
	РеквизитыВидаКарты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтруктураДанныхКарты.ВидКарты, "ГенерироватьНомер, ПрисваиватьНомерКартыКНомеруТелефона");
	Если ПустаяСтрока(СтруктураДанныхКарты.Штрихкод) И ПустаяСтрока(СтруктураДанныхКарты.МагнитныйКод)
		И (РеквизитыВидаКарты.ГенерироватьНомер ИЛИ РеквизитыВидаКарты.ПрисваиватьНомерКартыКНомеруТелефона) Тогда
		КодКартыНовый = НСтр("ru = ''");
		Если РеквизитыВидаКарты.ГенерироватьНомер Тогда
			СгенерироватьКодКарты(СтруктураДанныхКарты.ВидКарты, КодКартыНовый, СтруктураДанныхКарты.ТорговыйОбъект);
		Иначе
			КодКартыНовый = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтруктураДанныхКарты.Контрагент, "НомерТелефонаДляПоиска");
		КонецЕсли;
		
		ТипКарты = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтруктураДанныхКарты.ВидКарты, "ТипКарты");
		ТипКартыШтриховая = ТипКарты = Перечисления.ТипыКарт.Штриховая;
		ТипКартыМагнитная = ТипКарты = Перечисления.ТипыКарт.Магнитная;
		Если ТипКартыШтриховая Тогда
			КартаОбъект.КодКартыШтрихкод = КодКартыНовый;
		ИначеЕсли ТипКартыМагнитная Тогда
			КартаОбъект.КодКартыМагнитный = КодКартыНовый;
		Иначе
			КартаОбъект.КодКартыШтрихкод = КодКартыНовый;
			КартаОбъект.КодКартыМагнитный = КодКартыНовый;
		КонецЕсли;
	КонецЕсли;
	КартаОбъект.Владелец   = СтруктураДанныхКарты.ВидКарты;
	
	КартаОбъект.ВладелецКарты = СтруктураДанныхКарты.Контрагент;
	
	КартаОбъект.Наименование = УстановитьНаименованиеДисконтнойКарты(КартаОбъект.Владелец, КартаОбъект.ВладелецКарты, КартаОбъект.КодКартыШтрихкод, КартаОбъект.КодКартыМагнитный);
	
	КартаОбъект.Записать();
	
	Возврат КартаОбъект.Ссылка;
	
КонецФункции


// Проверяет номер новой дисконтной карты принадлежности диапазону
//
// Параметры
//  НомерКарты - Строка - Номер дисконтной карты
//  ВидДисконтнойКарты - Справочник.ВидыДисконтныхКарт - вид дисконтной карты
//  СтруктурнаяЕдиница - Справочник.СтруктурныеЕдиницы - торговый объект для отбора шаблона генерации
//  ПринадлежитДиапазону - Булево - Признак принадлежности диапазону
//  СообщениеОбОшибке - Строка - Текст сообщения об ошибке
//
Процедура ПроверитьПринадлежностьДиапазону(НомерКарты, ВидДисконтнойКарты, СтруктурнаяЕдиница, ПринадлежитДиапазону, СообщениеОбОшибке) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СтруктурныеЕдиницы.Ссылка КАК Склад,
	|	СтруктурныеЕдиницы.Родитель КАК ГруппаСкладов
	|ПОМЕСТИТЬ втСтруктурнаяЕдиница
	|ИЗ
	|	Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ШаблоныГенерацииШтрихкодов.НачалоДиапазона КАК НачалоДиапазона,
	|	ШаблоныГенерацииШтрихкодов.КонецДиапазона КАК КонецДиапазона,
	|	ШаблоныГенерацииШтрихкодов.ДлинаДиапазона КАК ДлинаДиапазона
	|ИЗ
	|	Справочник.ВидыДисконтныхКарт КАК ВидыДисконтныхКарт
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШаблоныГенерацииШтрихкодов.ТаблицаНастройкиШаблонов КАК ШаблоныГенерацииШтрихкодов
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ втСтруктурнаяЕдиница КАК втСтруктурнаяЕдиница
	|			ПО ШаблоныГенерацииШтрихкодов.СтруктурнаяЕдиница = втСтруктурнаяЕдиница.Склад
	|		ПО ВидыДисконтныхКарт.ШаблонГенерацииШтрихкода = ШаблоныГенерацииШтрихкодов.Ссылка
	|ГДЕ
	|	ВидыДисконтныхКарт.Ссылка = &ВидДисконтнойКарты
	|	И НЕ ШаблоныГенерацииШтрихкодов.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.МагазинГруппаСкладов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ШаблоныГенерацииШтрихкодов.НачалоДиапазона,
	|	ШаблоныГенерацииШтрихкодов.КонецДиапазона,
	|	ШаблоныГенерацииШтрихкодов.ДлинаДиапазона
	|ИЗ
	|	Справочник.ВидыДисконтныхКарт КАК ВидыДисконтныхКарт
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШаблоныГенерацииШтрихкодов.ТаблицаНастройкиШаблонов КАК ШаблоныГенерацииШтрихкодов
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ втСтруктурнаяЕдиница КАК втСтруктурнаяЕдиница
	|			ПО ШаблоныГенерацииШтрихкодов.СтруктурнаяЕдиница = втСтруктурнаяЕдиница.ГруппаСкладов
	|		ПО ВидыДисконтныхКарт.ШаблонГенерацииШтрихкода = ШаблоныГенерацииШтрихкодов.Ссылка
	|ГДЕ
	|	ВидыДисконтныхКарт.Ссылка = &ВидДисконтнойКарты
	|	И ШаблоныГенерацииШтрихкодов.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.МагазинГруппаСкладов)";
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("ВидДисконтнойКарты", ВидДисконтнойКарты);
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		ДлинаНомера = СтрДлина(НомерКарты);
		Если ДлинаНомера <> Выборка.ДлинаДиапазона Тогда
			ПринадлежитДиапазону = Ложь;
			СообщениеОбОшибке = НСтр("ru = 'Номер карты %1 не соответствует длине диапазона'");
			СообщениеОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(СообщениеОбОшибке, НомерКарты);
		КонецЕсли;
		
		Если ПринадлежитДиапазону И НЕ (НомерКарты >= Выборка.НачалоДиапазона
			И НомерКарты <= Выборка.КонецДиапазона) Тогда
			ПринадлежитДиапазону = Ложь;
			СообщениеОбОшибке = НСтр("ru = 'Номер карты %1 не принадлежит диапазону'");
			СообщениеОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(СообщениеОбОшибке, НомерКарты);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Генерирует код карты по заданному правилу в виде дисконтной карты
//
// Параметры:
//  ВидДисконтнойКарты - Справочник.ВидыДисконтныхКарт - вид дисконтной карты.
//  КодКарты - Строка - сгенерированный код карты.
//  СтруктурнаяЕдиница - Справочник.СтруктурныеЕдиницы - торговый объект отбора шаблона генерации карты.
//
Процедура СгенерироватьКодКарты(ВидДисконтнойКарты, КодКарты, СтруктурнаяЕдиница) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СтруктурныеЕдиницы.Ссылка КАК Склад,
	|	СтруктурныеЕдиницы.Родитель КАК ГруппаСкладов
	|ПОМЕСТИТЬ втСтруктурнаяЕдиница
	|ИЗ
	|	Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
	|ГДЕ
	|	СтруктурныеЕдиницы.Ссылка = &СтруктурнаяЕдиница
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВидыДисконтныхКарт.ШаблонГенерацииШтрихкода КАК ШаблонГенерацииШтрихкода,
	|	ШаблоныГенерацииШтрихкодов.ДлинаДиапазона КАК ДлинаДиапазона,
	|	ШаблоныГенерацииШтрихкодов.НачалоДиапазона КАК НачалоДиапазона,
	|	ШаблоныГенерацииШтрихкодов.КонецДиапазона КАК КонецДиапазона,
	|	1 КАК Приоритет
	|ПОМЕСТИТЬ втПравилаГенерацииШтрихкода
	|ИЗ
	|	Справочник.ВидыДисконтныхКарт КАК ВидыДисконтныхКарт
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ШаблоныГенерацииШтрихкодов.ТаблицаНастройкиШаблонов КАК ШаблоныГенерацииШтрихкодов
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ втСтруктурнаяЕдиница КАК втСтруктурнаяЕдиница
	|			ПО ШаблоныГенерацииШтрихкодов.СтруктурнаяЕдиница = втСтруктурнаяЕдиница.Склад
	|		ПО ВидыДисконтныхКарт.ШаблонГенерацииШтрихкода = ШаблоныГенерацииШтрихкодов.Ссылка
	|ГДЕ
	|	ВидыДисконтныхКарт.Ссылка = &ВидДисконтнойКарты
	|	И НЕ &СтруктурнаяЕдиница = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	|	И НЕ ШаблоныГенерацииШтрихкодов.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.МагазинГруппаСкладов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВидыДисконтныхКарт.ШаблонГенерацииШтрихкода,
	|	ШаблоныГенерацииШтрихкодов.ДлинаДиапазона,
	|	ШаблоныГенерацииШтрихкодов.НачалоДиапазона,
	|	ШаблоныГенерацииШтрихкодов.КонецДиапазона,
	|	2
	|ИЗ
	|	Справочник.ВидыДисконтныхКарт КАК ВидыДисконтныхКарт
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ШаблоныГенерацииШтрихкодов.ТаблицаНастройкиШаблонов КАК ШаблоныГенерацииШтрихкодов
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ втСтруктурнаяЕдиница КАК втСтруктурнаяЕдиница
	|			ПО ШаблоныГенерацииШтрихкодов.СтруктурнаяЕдиница = втСтруктурнаяЕдиница.ГруппаСкладов
	|		ПО ВидыДисконтныхКарт.ШаблонГенерацииШтрихкода = ШаблоныГенерацииШтрихкодов.Ссылка
	|ГДЕ
	|	ВидыДисконтныхКарт.Ссылка = &ВидДисконтнойКарты
	|	И НЕ &СтруктурнаяЕдиница = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	|	И ШаблоныГенерацииШтрихкодов.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.МагазинГруппаСкладов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВидыДисконтныхКарт.ШаблонГенерацииШтрихкода,
	|	ШаблоныГенерацииШтрихкодов.ДлинаДиапазона,
	|	ШаблоныГенерацииШтрихкодов.НачалоДиапазона,
	|	ШаблоныГенерацииШтрихкодов.КонецДиапазона,
	|	3
	|ИЗ
	|	Справочник.ВидыДисконтныхКарт КАК ВидыДисконтныхКарт
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ШаблоныГенерацииШтрихкодов.ТаблицаНастройкиШаблонов КАК ШаблоныГенерацииШтрихкодов
	|		ПО ВидыДисконтныхКарт.ШаблонГенерацииШтрихкода = ШаблоныГенерацииШтрихкодов.Ссылка
	|ГДЕ
	|	ВидыДисконтныхКарт.Ссылка = &ВидДисконтнойКарты
	|	И &СтруктурнаяЕдиница = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	втПравилаГенерацииШтрихкода.ШаблонГенерацииШтрихкода КАК ШаблонГенерацииШтрихкода,
	|	втПравилаГенерацииШтрихкода.ДлинаДиапазона КАК ДлинаДиапазона,
	|	втПравилаГенерацииШтрихкода.НачалоДиапазона КАК НачалоДиапазона,
	|	втПравилаГенерацииШтрихкода.КонецДиапазона КАК КонецДиапазона
	|ПОМЕСТИТЬ втШаблонГенерацииШтрихкода
	|ИЗ
	|	втПравилаГенерацииШтрихкода КАК втПравилаГенерацииШтрихкода
	|
	|УПОРЯДОЧИТЬ ПО
	|	втПравилаГенерацииШтрихкода.Приоритет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втШаблонГенерацииШтрихкода.ДлинаДиапазона КАК ДлинаДиапазона,
	|	втШаблонГенерацииШтрихкода.НачалоДиапазона КАК НачалоДиапазона,
	|	втШаблонГенерацииШтрихкода.КонецДиапазона КАК КонецДиапазона,
	|	МАКСИМУМ(ДисконтныеКарты.КодКартыШтрихкод) КАК КодКартыШтрихкод,
	|	МАКСИМУМ(ДисконтныеКарты.КодКартыМагнитный) КАК КодКартыМагнитный,
	|	ВидыДисконтныхКарт.ТипКарты КАК ТипКарты
	|ИЗ
	|	Справочник.ДисконтныеКарты КАК ДисконтныеКарты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыДисконтныхКарт КАК ВидыДисконтныхКарт
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ втШаблонГенерацииШтрихкода КАК втШаблонГенерацииШтрихкода
	|			ПО ВидыДисконтныхКарт.ШаблонГенерацииШтрихкода = втШаблонГенерацииШтрихкода.ШаблонГенерацииШтрихкода
	|		ПО ДисконтныеКарты.Владелец = ВидыДисконтныхКарт.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	втШаблонГенерацииШтрихкода.ДлинаДиапазона,
	|	втШаблонГенерацииШтрихкода.НачалоДиапазона,
	|	втШаблонГенерацииШтрихкода.КонецДиапазона,
	|	ВидыДисконтныхКарт.ТипКарты";
	Запрос.УстановитьПараметр("ВидДисконтнойКарты", ВидДисконтнойКарты);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);

	Выборка = Запрос.Выполнить().Выбрать();
	КодКартыНовый = НСтр("ru = ''");
	Если Выборка.Следующий() Тогда
		ОписаниеТиповЧисло = Новый ОписаниеТипов("Число");
		Если Выборка.ТипКарты = Перечисления.ТипыКарт.Штриховая
			Или Выборка.ТипКарты = Перечисления.ТипыКарт.Смешанная Тогда
			КодКартыНовый = Макс(Выборка.КодКартыШтрихкод, Выборка.НачалоДиапазона);
		Иначе
			КодКартыНовый = Макс(Выборка.КодКартыМагнитный, Выборка.НачалоДиапазона);
		КонецЕсли;
		КодКартыЧисло = ОписаниеТиповЧисло.ПривестиЗначение(КодКартыНовый) + 1;
		ФорматнаяСтрока = НСтр("ru = 'ЧВН=; ЧЦ=%1; ЧГ=0'");
		ФорматнаяСтрока = СтрШаблон(ФорматнаяСтрока, Выборка.ДлинаДиапазона);
		КодКарты = Формат(КодКартыЧисло, ФорматнаяСтрока);
	Иначе
		ЗаполнитьНачалоДиапазонаПоВидуДисконтнойКарты(ВидДисконтнойКарты, СтруктурнаяЕдиница, КодКарты);
	КонецЕсли;
КонецПроцедуры

// Процедура формирует наименование элемента справочника по значению других реквизитов.
//
// Параметры
//  Владелец - СправочникСсылка.ВидыДисконтныхКарт
//  ВладелецКарты - СправочникСсылка.Контрагенты - владелец дисконтной карты
//  КодКартыШтрихкод - Строка - штрихкод карты
//  КодКартыМагнитный - Строка - магнитный код карты
//
// Возвращаемое значение
//  Строка - наименование дисконтной карты
//
Функция УстановитьНаименованиеДисконтнойКарты(Владелец, ВладелецКарты, КодКартыШтрихкод, КодКартыМагнитный) Экспорт

	Если Владелец.ТипКарты = Перечисления.ТипыКарт.Смешанная Тогда
		КодКартыСтр = СокрЛП(КодКартыШтрихкод) + " / " + СокрЛП(КодКартыМагнитный);
	ИначеЕсли Владелец.ТипКарты = Перечисления.ТипыКарт.Магнитная Тогда
		КодКартыСтр = СокрЛП(КодКартыМагнитный);
	Иначе
		КодКартыСтр = СокрЛП(КодКартыШтрихкод);
	КонецЕсли;
	
	ТекНаименование = "" + ?(ВладелецКарты.Пустая() ИЛИ Не Владелец.ЭтоИменнаяКарта, "", ""+ВладелецКарты+". ") +
	                      ?(Владелец.Пустая(), "", ""+Владелец+". ")
						  + КодКартыСтр;
						  
	Возврат ТекНаименование;

КонецФункции // ПолучитьНаименованиеДисконтнойКарты()

// Процедура заполняет массив дисконтных карт по владельцу
//
// Параметры
//  МассивДисконтныхКарт - Массив - список дисконтных карт по владельцу.
//  Контрагент - Справочник.Контрагенты - Владелец дисконтной карты.
Процедура ПолучитьМассивДисконтныхКартПоВладельцу(МассивДисконтныхКарт, Контрагент) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	МассивДисконтныхКарт.Очистить();
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ДисконтныеКарты.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ втСписокДисконтныхКарт
	|ИЗ
	|	Справочник.ДисконтныеКарты КАК ДисконтныеКарты
	|ГДЕ
	|	ДисконтныеКарты.ВладелецКарты = &ВладелецКарты
	|	И НЕ ДисконтныеКарты.ПометкаУдаления
	|	И НЕ ДисконтныеКарты.КартаНедействительна
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втСписокДисконтныхКарт.Ссылка КАК ДисконтнаяКарта,
	|	ЕСТЬNULL(БонусныеБаллыОстатки.НачисленоОстаток, 0) - ЕСТЬNULL(БонусныеБаллыОстатки.КСписаниюОстаток, 0) КАК ОстатокБонусныхБаллов
	|ИЗ
	|	втСписокДисконтныхКарт КАК втСписокДисконтныхКарт
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.БонусныеБаллы.Остатки(&ДатаСеанса, ) КАК БонусныеБаллыОстатки
	|		ПО втСписокДисконтныхКарт.Ссылка = БонусныеБаллыОстатки.БонуснаяКарта";
	Запрос.УстановитьПараметр("ДатаСеанса", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("ВладелецКарты", Контрагент);
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			СтруктураДанных = Новый Структура("ДисконтнаяКарта, ОстатокБонусныхБаллов", Выборка.ДисконтнаяКарта, Выборка.ОстатокБонусныхБаллов);
			МассивДисконтныхКарт.Добавить(СтруктураДанных);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

// Процедура заполняет остаток бонусных баллов и оборот продаж по дисконтной картой
//
// Параметры:
//  ДисконтнаяКарта - Справочник.ДисконтныеКарты - Дисконтная карта.
//
// Возвращаемое значение
//  ДанныеКарты - Структура - данные карты
//  *ОстатокБонусныхБаллов - Число - остаток бонусных баллов по дисконтной карте.
//  *ПродажиОборот - Число - оборот продаж по дисконтной карте.
Функция ПолучитьДанныеКарты(ДисконтнаяКарта) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ДисконтныеКарты.Ссылка КАК ДисконтнаяКарта
	|ПОМЕСТИТЬ втДанныеДисконтнойКарты
	|ИЗ
	|	Справочник.ДисконтныеКарты КАК ДисконтныеКарты
	|ГДЕ
	|	ДисконтныеКарты.Ссылка = &ДисконтнаяКарта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(БонусныеБаллыОстатки.НачисленоОстаток, 0) - ЕСТЬNULL(БонусныеБаллыОстатки.КСписаниюОстаток, 0) - ЕСТЬNULL(БонусныеБаллыКСписанию.КСписанию, 0) < 0
	|			ТОГДА 0
	|		ИНАЧЕ ЕСТЬNULL(БонусныеБаллыОстатки.НачисленоОстаток, 0) - ЕСТЬNULL(БонусныеБаллыОстатки.КСписаниюОстаток, 0) - ЕСТЬNULL(БонусныеБаллыКСписанию.КСписанию, 0)
	|	КОНЕЦ КАК ОстатокБонусныхБаллов,
	|	ЕСТЬNULL(ПродажиПоДисконтнымКартамОбороты.СуммаОборот, 0) КАК ПродажиОборот
	|ИЗ
	|	втДанныеДисконтнойКарты КАК втДанныеДисконтнойКарты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.БонусныеБаллы.Остатки(&ДатаСеанса, БонуснаяКарта = &ДисконтнаяКарта) КАК БонусныеБаллыОстатки
	|		ПО втДанныеДисконтнойКарты.ДисконтнаяКарта = БонусныеБаллыОстатки.БонуснаяКарта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПродажиПоДисконтнымКартам.Обороты(, &ДатаСеанса, , ) КАК ПродажиПоДисконтнымКартамОбороты
	|		ПО втДанныеДисконтнойКарты.ДисконтнаяКарта = ПродажиПоДисконтнымКартамОбороты.ДисконтнаяКарта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.БонусныеБаллыКСписанию КАК БонусныеБаллыКСписанию
	|		ПО втДанныеДисконтнойКарты.ДисконтнаяКарта = БонусныеБаллыКСписанию.ДисконтнаяКарта";
	Запрос.УстановитьПараметр("ДатаСеанса", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("ДисконтнаяКарта", ДисконтнаяКарта);
	РезультатЗапроса = Запрос.Выполнить();
	ДанныеКарты = Новый Структура("ОстатокБаллов, ПродажиОборот", 0, 0);
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		ДанныеКарты.ОстатокБаллов = Выборка.ОстатокБонусныхБаллов;
		ДанныеКарты.ПродажиОборот = Выборка.ПродажиОборот;
	КонецЕсли;
	
	Возврат ДанныеКарты;
КонецФункции

// Создает списание и начисление бонусов по полученным параметрам с сервера лояльности
//
// Параметры:
//  ПараметрыРасчета - Структура - структура, содержащая в себе параметры списания/начисления бонусных баллов:
//  * БонуснаяПрограмма - СправочникСсылка.БонусныеПрограммы - бонусная программа.
//  * БонуснаяКарта - СправочникСсылка.ДисконтныеКарты - бонусная карта начисления
//  * ТаблицаБонусныхКарт - ТаблицаЗначений - Таблица бонусных карт.
//  СтруктураОтвета	 - Структура - структура, содержащая в себе параметры ответа:
//  * ЕстьОшибки - Булево - признак наличия ошибок при выполнении метода.
//  * ТекстОшибки - Булево - признак наличия ошибок при выполнении метода.
//
Процедура ОбъединитьБонусныеКарты(ПараметрыРасчета, СтруктураОтвета) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	ДокументСписанияНачисления = Документы.НачислениеСписаниеБонусныхБаллов.СоздатьДокумент();
	ИмяСобытия = НСтр("ru = 'СерверЛояльности.ОбъединитьБонусныеКарты'", ОбщегоНазначения.КодОсновногоЯзыка());

	Попытка
		ДокументСписанияНачисления.Заблокировать();
	Исключение

		ОписаниеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		СтруктураОтвета.Error = Истина;
		СтруктураОтвета.ErrorMessage = ОписаниеОшибки;
		ЗаписьЖурналаРегистрации(ИмяСобытия, , , , ОписаниеОшибки);
		Возврат;
	КонецПопытки;

	ДокументСписанияНачисления.Дата = ТекущаяДатаСеанса();
	ДокументСписанияНачисления.БонуснаяПрограмма = ПараметрыРасчета.БонуснаяПрограмма;
	ДокументСписанияНачисления.Комментарий = НСтр("ru = 'Автоматическое создание документа'");
	ДокументСписанияНачисления.Автор = Пользователи.ТекущийПользователь();
	РеквизитыБП = РаботаСБонусами.ПолучитьБонуснуюПрограмму(ПараметрыРасчета.БонуснаяКарта);

	МассивКарт = ПараметрыРасчета.ТаблицаБонусныхКарт.ВыгрузитьКолонку("БонуснаяКарта");
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	БонусныеБаллы.Период КАК Период,
	|	БонусныеБаллы.КСписанию КАК КСписанию,
	|	БонусныеБаллы.БонуснаяКарта КАК БонуснаяКарта
	|ИЗ
	|	РегистрНакопления.БонусныеБаллы КАК БонусныеБаллы
	|ГДЕ
	|	БонусныеБаллы.Период >= &Период
	|	И БонусныеБаллы.БонуснаяКарта В(&МассивКарт)";
	Запрос.УстановитьПараметр("МассивКарт", МассивКарт);
	Запрос.УстановитьПараметр("Период", НачалоДня(ДокументСписанияНачисления.Дата + 1));

	Результат = Запрос.Выполнить().Выгрузить();
	Для Каждого СтрокаТаблицы Из ПараметрыРасчета.ТаблицаБонусныхКарт Цикл
		КоличествоОбщее = СтрокаТаблицы.Количество;
		НоваяСтрокаСписание = ДокументСписанияНачисления.СписанияБонусов.Добавить();
		НоваяСтрокаСписание.БонуснаяКарта = СтрокаТаблицы.БонуснаяКарта;
		НоваяСтрокаСписание.Количество = СтрокаТаблицы.Количество;
		РеквизитыБПСписание = РаботаСБонусами.ПолучитьБонуснуюПрограмму(СтрокаТаблицы.БонуснаяКарта);
		
		СтрокиКСписанию = Результат.НайтиСтроки(Новый Структура("БонуснаяКарта", СтрокаТаблицы.БонуснаяКарта));
		Для Каждого СтрокаКСписанию Из СтрокиКСписанию Цикл
			Если КоличествоОбщее <= 0
				ИЛИ СтрокаКСписанию.КСписанию <= 0 Тогда
				Продолжить;
			КонецЕсли;
			Количество = Мин(СтрокаКСписанию.КСписанию, КоличествоОбщее);
			НоваяСтрокаСписание = ДокументСписанияНачисления.НачисленияБонусов.Добавить();
			НоваяСтрокаСписание.БонуснаяКарта = ПараметрыРасчета.БонуснаяКарта;
			НоваяСтрокаСписание.Количество = Количество * РеквизитыБПСписание.КурсБонусов / РеквизитыБП.КурсБонусов;
			НоваяСтрокаСписание.ДатаНачисления = ДокументСписанияНачисления.Дата;
			НоваяСтрокаСписание.ДатаСгорания = СтрокаКСписанию.Период;
			КоличествоОбщее = КоличествоОбщее - Количество;
		КонецЦикла;
		
		Если КоличествоОбщее > 0 Тогда
			НоваяСтрокаСписание = ДокументСписанияНачисления.НачисленияБонусов.Добавить();
			НоваяСтрокаСписание.БонуснаяКарта = ПараметрыРасчета.БонуснаяКарта;
			НоваяСтрокаСписание.Количество = КоличествоОбщее * РеквизитыБПСписание.КурсБонусов / РеквизитыБП.КурсБонусов;
			НоваяСтрокаСписание.ДатаНачисления = ДокументСписанияНачисления.Дата;
		КонецЕсли;
	КонецЦикла;
	
	Попытка
		ДокументСписанияНачисления.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		ОписаниеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		СтруктураОтвета.Error = Истина;
		СтруктураОтвета.ErrorMessage = ОписаниеОшибки;
		ЗаписьЖурналаРегистрации(ИмяСобытия, , , , ОписаниеОшибки);
		Возврат;
	КонецПопытки;
	
	Для Каждого СтрокаТаблицы Из ПараметрыРасчета.ТаблицаБонусныхКарт Цикл
			НачатьТранзакцию();
			Попытка
				Блокировка = Новый БлокировкаДанных;
				ЭлементБлокировки = Блокировка.Добавить(Метаданные.Справочники.ДисконтныеКарты.ПолноеИмя());
				Блокировка.Заблокировать();
				
				БонуснаяКартаОбъект = СтрокаТаблицы.БонуснаяКарта.ПолучитьОбъект();
				БонуснаяКартаОбъект.КартаНедействительна = Истина;
				БонуснаяКартаОбъект.Записать();
				ЗафиксироватьТранзакцию();
			Исключение
				ОтменитьТранзакцию();
				
				ЗаписьЖурналаРегистрации(ИмяСобытия, , , , ОписаниеОшибки);
			КонецПопытки;
			
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Определяет соответствует ли код карты шаблону
// На входе:
// ДанныеДорожек - Массив содержащий строки кода дорожки. Всего 3 Элемента.
// ДанныеШаблона - структура содержащая данные шаблона:
//	- Суффикс
//	- Префикс
//	- РазделительБлоков
//	- ДлинаКода
// На выходе:
// Истина - код соответствует шаблону
Функция ПростаяПроверкаШаблонаМК(КодКарты, ДанныеШаблона)
	
	// Проверяем только одну дорожку.
	текСтрока = КодКарты;
	Если (НЕ ДанныеШаблона.БезОграниченияРазмера И СтрДлина(текСтрока) > ДанныеШаблона.ДлинаКода)
		ИЛИ (ДанныеШаблона.ДлинаПоля > 0 И СтрДлина(текСтрока) > ДанныеШаблона.ДлинаПоля)
	Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// Функция возвращает структуру с датой начала и окончания периода накопления по дисконтной карте,
// а также текстовое представление периода.
//
Функция ПолучитьПериодРасчетаНакопительныхСкидокПоДисконтнойКарте(ДатаСкидки, ДисконтнаяКарта)
	
	Если Не ЗначениеЗаполнено(ДатаСкидки) Тогда
		ДатаСкидки = ТекущаяДата();
	КонецЕсли;
	
	ПредставлениеПериода = "";
	Если ДисконтнаяКарта.Владелец.ВидПериода = Перечисления.ВидыПериодовДляНакопительныхСкидок.ВесьПериод Тогда
		НачалоПериода = '00010101';
		КонецПериода = '00010101';
		ПредставлениеПериода = "за всё время";
	ИначеЕсли ДисконтнаяКарта.Владелец.ВидПериода = Перечисления.ВидыПериодовДляНакопительныхСкидок.Текущий Тогда
		Если ДисконтнаяКарта.Владелец.Периодичность = Перечисления.Периодичность.Год Тогда
			НачалоПериода = НачалоГода(ДатаСкидки);
			ПредставлениеПериода = "за текущий год";
		ИначеЕсли ДисконтнаяКарта.Владелец.Периодичность = Перечисления.Периодичность.Квартал Тогда
			НачалоПериода = НачалоКвартала(ДатаСкидки);
			ПредставлениеПериода = "за текущий квартал";
		ИначеЕсли ДисконтнаяКарта.Владелец.Периодичность = Перечисления.Периодичность.Месяц Тогда
			НачалоПериода = НачалоМесяца(ДатаСкидки);
			ПредставлениеПериода = "за текущий месяц";
		КонецЕсли;
		КонецПериода = КонецДня(ДатаСкидки);
	ИначеЕсли ДисконтнаяКарта.Владелец.ВидПериода = Перечисления.ВидыПериодовДляНакопительныхСкидок.Прошлый Тогда
		Если ДисконтнаяКарта.Владелец.Периодичность = Перечисления.Периодичность.Год Тогда
			ДатаПредПериода = ДобавитьМесяц(ДатаСкидки, -12);
			НачалоПериода = НачалоГода(ДатаПредПериода);
			КонецПериода = КонецГода(ДатаПредПериода);
			ПредставлениеПериода = "за прошлый год";
		ИначеЕсли ДисконтнаяКарта.Владелец.Периодичность = Перечисления.Периодичность.Квартал Тогда
			ДатаПредПериода = ДобавитьМесяц(ДатаСкидки, -3);
			НачалоПериода = НачалоКвартала(ДатаПредПериода);
			КонецПериода = КонецКвартала(ДатаПредПериода);
			ПредставлениеПериода = "за прошлый квартал";
		ИначеЕсли ДисконтнаяКарта.Владелец.Периодичность = Перечисления.Периодичность.Месяц Тогда
			ДатаПредПериода = ДобавитьМесяц(ДатаСкидки, -1);
			НачалоПериода = НачалоМесяца(ДатаПредПериода);
			КонецПериода = КонецМесяца(ДатаПредПериода);
			ПредставлениеПериода = "за прошлый месяц";
		КонецЕсли;
	ИначеЕсли ДисконтнаяКарта.Владелец.ВидПериода = Перечисления.ВидыПериодовДляНакопительныхСкидок.Последний Тогда
		Если ДисконтнаяКарта.Владелец.Периодичность = Перечисления.Периодичность.Год Тогда
			ДатаПредПериода = ДобавитьМесяц(ДатаСкидки, -12);
			ПредставлениеПериода = "за последний год";
		ИначеЕсли ДисконтнаяКарта.Владелец.Периодичность = Перечисления.Периодичность.Квартал Тогда
			ДатаПредПериода = ДобавитьМесяц(ДатаСкидки, -3);
			ПредставлениеПериода = "за последний квартал";
		ИначеЕсли ДисконтнаяКарта.Владелец.Периодичность = Перечисления.Периодичность.Месяц Тогда
			ДатаПредПериода = ДобавитьМесяц(ДатаСкидки, -1);
			ПредставлениеПериода = "за последний месяц";
		КонецЕсли;		
		НачалоПериода = НачалоДня(ДатаПредПериода);
		КонецПериода = НачалоДня(ДатаСкидки) - 1; // Конец предыдущего дня.
	Иначе
		НачалоПериода = '00010101';
		КонецПериода = '00010101';
		ПредставлениеПериода = "";
	КонецЕсли;
	
	Возврат Новый Структура("НачалоПериода, КонецПериода, ПредставлениеПериода", НачалоПериода, КонецПериода, ПредставлениеПериода);

КонецФункции // ПолучитьПериодРасчетаНакопительныхСкидокПоДисконтнойКарте()

// Заполняет начало диапазона по виду дисконтной карты
Процедура ЗаполнитьНачалоДиапазонаПоВидуДисконтнойКарты(ВидДисконтнойКарты, СтруктурнаяЕдиница, НачалоДиапазона)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВидыДисконтныхКарт.ШаблонГенерацииШтрихкода КАК ШаблонГенерацииШтрихкода
	|ПОМЕСТИТЬ втДанныеШаблонГенерацииШтрихкода
	|ИЗ
	|	Справочник.ВидыДисконтныхКарт КАК ВидыДисконтныхКарт
	|ГДЕ
	|	ВидыДисконтныхКарт.Ссылка = &ВидДисконтнойКарты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ШаблоныГенерацииШтрихкодовТаблицаНастройкиШаблонов.НачалоДиапазона КАК НачалоДиапазона
	|ИЗ
	|	втДанныеШаблонГенерацииШтрихкода КАК втДанныеШаблонГенерацииШтрихкода
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШаблоныГенерацииШтрихкодов.ТаблицаНастройкиШаблонов КАК ШаблоныГенерацииШтрихкодовТаблицаНастройкиШаблонов
	|		ПО втДанныеШаблонГенерацииШтрихкода.ШаблонГенерацииШтрихкода = ШаблоныГенерацииШтрихкодовТаблицаНастройкиШаблонов.Ссылка
	|ГДЕ
	|	&СтруктурнаяЕдиница = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ШаблоныГенерацииШтрихкодовТаблицаНастройкиШаблонов.НачалоДиапазона
	|ИЗ
	|	втДанныеШаблонГенерацииШтрихкода КАК втДанныеШаблонГенерацииШтрихкода
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШаблоныГенерацииШтрихкодов.ТаблицаНастройкиШаблонов КАК ШаблоныГенерацииШтрихкодовТаблицаНастройкиШаблонов
	|		ПО втДанныеШаблонГенерацииШтрихкода.ШаблонГенерацииШтрихкода = ШаблоныГенерацииШтрихкодовТаблицаНастройкиШаблонов.Ссылка
	|ГДЕ
	|	ШаблоныГенерацииШтрихкодовТаблицаНастройкиШаблонов.СтруктурнаяЕдиница = &СтруктурнаяЕдиница";
	Запрос.УстановитьПараметр("ВидДисконтнойКарты", ВидДисконтнойКарты);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Если Выборка.Следующий() Тогда
			НачалоДиапазона = Выборка.НачалоДиапазона;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
